This is still happening in v4.104.0

Is it clear we are dealing with a data loss issue? Seemingly that would elevate the concern.

I have tried work around the issue by manually adding in new volumes via the Console but the issue persists wanting to destroy the volume group and all related backup history (plus now DR Protection Group information). Argh!


Script is very simple. After creating new volumes, am updating the `source_details` of the `oci_core_volume_group`

```hcl
  source_deatails {
    type = "volumeIds"
    volume_ids = [
      var.the_boot_volume_id,
      var.storage_volume_id,
      var.the_new_storage_volume_id
    ]
  }
```

See here if I try to add to the Volume Group with TF only

```hcl
  # module.all_compute.oci_core_volume_group.these["oiam12"] must be replaced
-/+ resource "oci_core_volume_group" "these" {
      ~ freeform_tags       = {} -> (known after apply)
      ~ id                  = "ocid1.volumegroup.oc1.iad.anuwcljsbnkfddiawqed7vcyn7vs674hgc7gqafidf7gaxli56mfbuwprcja" -> (known after apply)
      + is_hydrated         = (known after apply)
      ~ size_in_gbs         = "300" -> (known after apply)
      ~ size_in_mbs         = "307200" -> (known after apply)
      ~ state               = "AVAILABLE" -> (known after apply)
      ~ time_created        = "2022-07-28 16:09:39.053 +0000 UTC" -> (known after apply)
      ~ volume_ids          = [
          - "ocid1.bootvolume.oc1.iad.anuwcljsbnkfdfidf7gaxli56mfbudiawqed7vcyn7vs674hgc7gqawprcja",
          - "ocid1.volume.oc1.iad.abuwcljsvsbfevikrl54677xe2l66ouwzuizdpuyovnxwauhdoycuboehpjq",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_details {
          ~ volume_ids = [ # forces replacement
              + "ocid1.volume.oc1.iad.abuwcljsvsbfevikrl54677xe2l66ouwzuizdpuyovnxwauhdoycuboehpjq",
              + "ocid1.volume.oc1.iad.abuwcljsxrqtxpjtn4ieecyibzuksmf5wef4x72zqaj6m6gbwkuyn3np5ria",
                # (2 unchanged elements hidden)
            ]
            # (1 unchanged attribute hidden)
        }

      + volume_group_replicas {
          + availability_domain     = (known after apply)
          + display_name            = (known after apply)
          + volume_group_replica_id = (known after apply)
        }
    }
```

See  here if I add the new volumes via the Console then try to `apply` the matching TF script.

```hcl
  # module.all_compute.oci_core_volume_group.these["oiam12"] must be replaced
-/+ resource "oci_core_volume_group" "these" {
      ~ freeform_tags       = {} -> (known after apply)
      ~ id                  = "ocid1.volumegroup.oc1.iad.anuwcljsbnkfdfidf7gaxli56mfbudiawqed7vcyn7vs674hgc7gqawprcja" -> (known after apply)
      + is_hydrated         = (known after apply)
      ~ size_in_gbs         = "700" -> (known after apply)
      ~ size_in_mbs         = "716800" -> (known after apply)
      ~ state               = "AVAILABLE" -> (known after apply)
      ~ time_created        = "2022-07-28 16:09:39.053 +0000 UTC" -> (known after apply)
      ~ volume_ids          = [
          - "ocid1.bootvolume.oc1.iad.abuwcljs4azgvhsn2uwxej77buhdhagqhaibvyytsuskr226zx36xis7jgca",
          - "ocid1.volume.oc1.iad.abuwcljsqj7iwqurz4qqo3jx3nzgmmt7ozivk6tszdryjplnbjla5gztublq",
          - "ocid1.volume.oc1.iad.abuwcljsvsbfevikrl54677xe2l66ouwzuizdpuyovnxwauhdoycuboehpjq",
          - "ocid1.volume.oc1.iad.abuwcljsxrqtxpjtn4ieecyibzuksmf5wef4x72zqaj6m6gbwkuyn3np5ria",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_details {
          ~ volume_ids = [ # forces replacement
              + "ocid1.volume.oc1.iad.abuwcljsqj7iwqurz4qqo3jx3nzgmmt7ozivk6tszdryjplnbjla5gztublq",
              + "ocid1.volume.oc1.iad.abuwcljsxrqtxpjtn4ieecyibzuksmf5wef4x72zqaj6m6gbwkuyn3np5ria",
                # (2 unchanged elements hidden)
            ]
            # (1 unchanged attribute hidden)
        }

      + volume_group_replicas {
          + availability_domain     = (known after apply)
          + display_name            = (known after apply)
          + volume_group_replica_id = (known after apply)
        }
    }
```

I can't win… 😞 